ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
    logmsg("Platform: ", g_platform_name);
    logmsg("FW Version: ", g_log_firmwareversion);

    logmsg("DIP switch settings: cablesel ", (int)g_dip_cable_sel, ", drive_id ", (int)g_dip_drive_id, " debug log ", (int)dbglog);

    g_log_debug = dbglog;

#ifndef ARM_NONSECURE_MODE
    // Get flash chip size
    uint8_t cmd_read_jedec_id[4] = {0x9f, 0, 0, 0};
    uint8_t response_jedec[4] = {0};
    flash_do_cmd(cmd_read_jedec_id, response_jedec, 4);
    g_flash_chip_size = (1 << response_jedec[3]);
    logmsg("Flash chip size: ", (int)(g_flash_chip_size / 1024), " kB");

    // Get flash chip unique ID
    // (flash_get_unique_id() from RP2040 libs didn't work for some reason)
    uint8_t cmd_read_uniq_id[13] = {0x4B};
    uint8_t response_uniq_id[13] = {0};
    flash_do_cmd(cmd_read_uniq_id, response_uniq_id, 13);
    memcpy(&g_flash_unique_id, response_uniq_id + 5, 8);
    logmsg("Flash unique ID: ", g_flash_unique_id);
#endif

    logmsg("System clock is set to ", (int) clock_get_hz(clk_sys), " Hz");

    // SD card pins
    // Card is used in SDIO mode, rp2040_sdio.cpp will redirect these to PIO1
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(SDIO_CLK,       GPIO_FUNC_SIO, true, false, true,  true, true);
    gpio_conf(SDIO_CMD,       GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D0,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D1,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D2,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D3,        GPIO_FUNC_SIO, true, false, false, true, true);

    // I2C pins
    //        pin                 function       pup   pdown  out    state fast
    gpio_conf(GPIO_I2C_SCL,       GPIO_FUNC_I2C, true, false, false,  true, true);
    gpio_conf(GPIO_I2C_SDA,       GPIO_FUNC_I2C, true, false, false,  true, true);

    // IDE bus control signals
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(CTRL_LOAD,      GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(CTRL_nEN,       GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(CTRL_IN_SEL,    GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(IDE_DATASEL,    GPIO_FUNC_SIO, false, false, true,  true, true);
    gpio_conf(IDE_DATADIR,    GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(IDE_IORDY_OUT,  GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(IDE_IORDY_EN,   GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(IDE_IOCS16,     GPIO_FUNC_SIO, false, false, true,  true,  true);

    // IDE bus status signals
    gpio_conf(IDE_RST,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DIOW,       GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DIOR,       GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA0,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA1,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA2,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_CS0,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_CS1,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DMACK,      GPIO_FUNC_SIO, false, false, false, false, true);

    // IDE bus data signals
    for (int i = 0; i < 16; i++)
    {
        gpio_conf(IDE_D0 + i, GPIO_FUNC_SIO, false, false, false, false, true);
    }

    // Status LED
    gpio_conf(STATUS_LED,     GPIO_FUNC_SIO, false,false, true,  false, false);
}

// late_init() only runs in main application
void platform_late_init()
{
    
}

uint8_t platform_check_for_controller()
{
    static bool checked = false;
    static uint8_t controller_found = 0;
    if (checked) return controller_found;
    g_wire.setClock(100000);
    // Setting the drive strength seems to help the I2C bus with the Pico W controller and the controller OLED display
    // to communicate and handshake properly
    gpio_set_drive_strength(GPIO_I2C_SCL, GPIO_DRIVE_STRENGTH_12MA);
    gpio_set_drive_strength(GPIO_I2C_SDA, GPIO_DRIVE_STRENGTH_12MA);
    
    g_rotary_input.SetI2c(&g_wire);
    bool hasHardwareUI = g_rotary_input.CheckForDevice();
    g_I2cServer.SetI2c(&g_wire);
    bool hasI2CServer = g_I2cServer.CheckForDevice();
    logmsg(hasHardwareUI ? "Hardware UI found." : "Hardware UI not found.");
    logmsg(hasI2CServer ? "I2C server found" : "I2C server not found");
    if(hasI2CServer)
    {
        g_I2CServerImageRequestPipe.Reset();
        g_I2CServerImageResponsePipe.Reset();
        g_I2CServerImageRequestPipe.AddObserver([&](zuluide::pipe::ImageRequest<zuluide::i2c::i2c_server_source_t> t){g_I2CServerImageResponsePipe.HandleRequest(t);});
    }
    controller_found = (hasHardwareUI ? CONTROLLER_TYPE_BOARD : 0) | (hasI2CServer ? CONTROLLER_TYPE_WIFI : 0);
    checked = true;
    return controller_found;
}

void platform_set_status_controller(zuluide::ObserverTransfer<zuluide::status::SystemStatus> *statusController) {
    logmsg("Initialized platform controller with the status controller.");
    display.init(&g_wire);
    statusController->AddObserver(processStatusUpdate);
    uiStatusController = statusController;
}

void platform_set_controller_image_response_pipe(zuluide::pipe::ImageResponsePipe<zuluide::control::select_controller_source_t> *imageRequestPipe) {
    logmsg("Initialized platform with filename request pipe");
    g_controllerImageResponsePipe = imageRequestPipe;
}

void platform_set_display_controller(zuluide::Observable<zuluide::control::DisplayState>& displayController) {
    logmsg("Initialized platform controller with the display controller.");
    displayController.AddObserver([&] (auto current) -> void {display.HandleUpdate(current);}); 
}

void platform_set_input_interface(zuluide::control::InputReceiver* inputReceiver) {
    logmsg("Initialized platform controller with input receiver.");
    g_rotary_input.SetReceiver(inputReceiver);
    g_rotary_input.StartSendingEvents();
}

void platform_set_device_control(zuluide::status::DeviceControlSafe* deviceControl) {
    logmsg("Initialized platform with device control.");
    char iniBuffer[100];
    memset(&iniBuffer, 0, 100);
    if (ini_gets("UI", "wifissid", "", iniBuffer, sizeof(iniBuffer), CONFIGFILE) > 0) {
        auto ssid = std::string(iniBuffer);
        g_I2cServer.SetSSID(ssid);
        logmsg("Set SSID from INI file to ", ssid.c_str());
        
        memset(&iniBuffer, 0, 100);
        if (ini_gets("UI", "wifipassword", "", iniBuffer, sizeof(iniBuffer), CONFIGFILE) > 0) {
            auto wifiPass = std::string(iniBuffer);
            g_I2cServer.SetPassword(wifiPass);
            logmsg("Set PASSWORD from INI file.");
        }
        
