ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
    hardware_alarm_set_target(alarm_num, delayed_by_ms(get_absolute_time(), 1000));
}

// This function can be used to periodically reset watchdog timer for crash handling.
// It can also be left empty if the platform does not use a watchdog timer.
void platform_reset_watchdog()
{
    g_watchdog_timeout = WATCHDOG_CRASH_TIMEOUT;
    g_watchdog_did_bus_reset = false;
    if (!g_watchdog_initialized)
    {
        int alarm_num = -1;
        for (int i = 0; i < NUM_GENERIC_TIMERS; i++)
        {
            if (!hardware_alarm_is_claimed(i))
            {
                alarm_num = i;
                break;
            }
        }
        if (alarm_num == -1)
        {
            logmsg("No free watchdog hardware alarms to claim");
            return;
        }
        hardware_alarm_claim(alarm_num);
        hardware_alarm_set_callback(alarm_num, &watchdog_callback);
        hardware_alarm_set_target(alarm_num, delayed_by_ms(get_absolute_time(), 1000));
        g_watchdog_initialized = true;
    }

    // USB log is polled here also to make sure any log messages in fault states
    // get passed to USB.
    usb_log_poll();
}

void usb_command_handler(char *cmd)
{
}

// Poll for commands sent through the USB serial port
void usb_command_poll()
{
    static uint8_t rx_buf[64];
    static int rx_len;

    uint32_t available = Serial.available();
    if (available > 0)
    {
        available = std::min<uint32_t>(available, sizeof(rx_buf) - rx_len);
        Serial.readBytes(rx_buf + rx_len, available);
        rx_len += available;
    }

    if (rx_len > 0)
    {
        char *first = (char*)rx_buf;
        for (int i = 0; i < rx_len; i++)
        {
            if (rx_buf[i] == '\n' || rx_buf[i] == '\r')
            {
                // Got complete line
                rx_buf[i] = '\0';
                usb_command_handler(first);
                rx_len = 0;
            }
            else if (isspace(*first))
            {
                first++;
            }
        }

        if (rx_len == sizeof(rx_buf))
        {
            // Too long line, discard
            rx_len = 0;
        }
    }
}

// Pass forwards log messages from core1 code.
void core1_log_poll()
{
    static uint32_t core1_log_readpos = 0;

    while (g_idecomm.logpos > core1_log_readpos)
    {
        char linebuf[128];
        int len = 0;
        while (len < sizeof(linebuf) - 1 && g_idecomm.logpos > core1_log_readpos)
        {
            char c = g_idecomm.core1_log[core1_log_readpos % sizeof(g_idecomm.core1_log)];
            core1_log_readpos++;

            if (c == '\n' || c == '\r')
            {
                if (len > 0)
                    break;
                else
                    continue;
            }

            linebuf[len++] = c;
        }

        if (len > 0)
        {
            linebuf[len] = '\0';
            logmsg("CORE1: ", linebuf);
        }
    }
}

// Poll function that is called every few milliseconds.
// Can be left empty or used for platform-specific processing.
void platform_poll(bool only_from_main)
{
    static uint32_t prev_poll_time;

    // Disable the RP2040Support.h interrupt, otherwise it steals our FIFO items
    // TODO: Find a better place to do this, it has to be after
    // framework-arduinopico/cores/rp2040/main.cpp runs.
    irq_set_enabled(SIO_IRQ_FIFO, false);

    // No point polling the USB hardware more often than once per millisecond
    uint32_t time_now = millis();
    if (time_now == prev_poll_time)
    {
        return;
    }
    prev_poll_time = time_now;

    // Monitor supply voltage and process USB events
    adc_poll();
    core1_log_poll();
    usb_log_poll();
    usb_command_poll();
    
    if (only_from_main)
    {
        platform_poll_input();

        if (uiStatusController)
        {
            // Process status update, if any exist.
            if (!uiStatusController->ProcessUpdate()) {
                // If no updates happend, refresh the display (enables animation)
                display.Refresh();
            }

            g_controllerImageResponsePipe->ProcessUpdates();
            g_I2cServer.Poll();
        }
        g_I2CServerImageRequestPipe.ProcessUpdates();
    }

#ifdef ENABLE_AUDIO_OUTPUT
    static bool update_volume = false;
    if (!update_volume && g_sdcard_present)
    {
        uint8_t max_volume = (uint8_t) ini_getl("IDE", "max_volume", 100, CONFIGFILE);
        if (max_volume > 100)
        {
            max_volume = 100;
            logmsg("The setting max_volume was set higher than 100, setting to 100 from ", (int) max_volume);
        }
        audio_set_max_volume(max_volume);
        update_volume = true;
        logmsg("Max volume set to ", (int) max_volume, "/100");
    }
    audio_poll();
#endif // ENABLE_AUDIO_OUTPUT
}

/*****************************************/
/* Flash reprogramming from bootloader   */
/*****************************************/

#ifdef PLATFORM_BOOTLOADER_SIZE

extern uint32_t __real_vectors_start;
extern uint32_t __StackTop;

// Check if we are currently running in ARM Secure state.
// If not, we need to reboot before reflashing.
static bool is_secure_mode()
{
    // This uses the TT instruction to check if the current
    // running location is configured as secure memory.
    uint32_t addr = (uint32_t)&is_secure_mode;
    uint32_t result = 0;
    asm("tt %0, %1" : "=r"(result) : "r"(addr) : "cc");
    return result & (1 << 22);
}

// Reboot and instruct the encrypted code bootloader to boot main firmware in secure mode.
// Core1 code will not be available to run, so normal IDE functionality is not available
// until next reboot.
static void reboot_to_secure()
{
    watchdog_hw->scratch[7] = 0x70ADC0DE;
    watchdog_hw->ctrl = WATCHDOG_CTRL_TRIGGER_BITS;
    while(1);
}

#define BOOTLOADER_OFFSET (128 * 1024)
#define MAINAPP_OFFSET (256 * 1024)

__attribute__((section(".time_critical.platform_rewrite_flash_page")))
bool platform_rewrite_flash_page(uint32_t offset, uint8_t buffer[PLATFORM_FLASH_PAGE_SIZE])
{
    if (offset == 0)
    {
        // Recognize either the magic word that starts the encrypted HSL library,
        // or the start of a normal unencrypted vector table. This is used to reject
        // clearly garbage files.
        bool is_hsl = (buffer[0] == 0x5A && buffer[1] == 0x48 && buffer[2] == 0x53 && buffer[3] == 0x4C);
        bool is_raw = (buffer[3] == 0x20 && buffer[7] == 0x10);

        if (!is_hsl && !is_raw)
        {
            logmsg("Invalid firmware file, starts with: ", bytearray(buffer, 16));
            return false;
        }
    }

