ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
    if (offset >= BOOTLOADER_OFFSET && offset < MAINAPP_OFFSET)
    {
        logmsg("Skipping bootloader area at offset ", offset);
        return true;
    }

#ifdef ARM_NONSECURE_MODE
    if (!is_secure_mode())
    {
        logmsg("Rebooting to secure mode for flashing");
        reboot_to_secure();
    }
#endif

    if (nvic_hw->iser[0] & (1 << 14))
    {
        logmsg("Disabling USB during firmware flashing");
        nvic_hw->icer[0] = 1 << 14;
        usb_hw->main_ctrl = 0;
    }

    dbgmsg("Writing flash at offset ", offset, " data ", bytearray(buffer, 4));
    assert(offset % PLATFORM_FLASH_PAGE_SIZE == 0);
    assert(offset >= PLATFORM_BOOTLOADER_SIZE);

    // Avoid any mbed timer interrupts triggering during the flashing.
    uint32_t saved_irq = save_and_disable_interrupts();

    flash_range_erase(offset, PLATFORM_FLASH_PAGE_SIZE);
    flash_range_program(offset, buffer, PLATFORM_FLASH_PAGE_SIZE);

    uint32_t *buf32 = (uint32_t*)buffer;
    uint32_t num_words = PLATFORM_FLASH_PAGE_SIZE / 4;
    for (int i = 0; i < num_words; i++)
    {
        uint32_t expected = buf32[i];
        uint32_t actual = *(volatile uint32_t*)(XIP_NOCACHE_NOALLOC_BASE + offset + i * 4);

        if (actual != expected)
        {
            logmsg("Flash verify failed at offset ", offset + i * 4, " got ", actual, " expected ", expected);
            return false;
        }
    }

    restore_interrupts(saved_irq);

    return true;
}

void platform_boot_to_main_firmware()
{
#ifdef ARM_NONSECURE_MODE
    if (is_secure_mode())
    {
        // Reboot to non-secure mode and the reset handler will jump to main firmware.
        watchdog_hw->scratch[6] = 0xB007;
        watchdog_hw->scratch[7] = 0;
        watchdog_hw->ctrl = WATCHDOG_CTRL_TRIGGER_BITS;
    }
#endif

    // Jump directly to main firmware
    uint32_t *application_base = (uint32_t*)(XIP_BASE + MAINAPP_OFFSET);
    scb_hw->vtor = (uint32_t)application_base;
    __asm__(
        "msr msp, %0\n\t"
        "bx %1" : : "r" (application_base[0]),
                    "r" (application_base[1]) : "memory");
}

void btldr_reset_handler()
{
    uint32_t* application_base = &__real_vectors_start;
    if (watchdog_hw->scratch[6] == 0xB007)
    {
        // Boot to main application
        watchdog_hw->scratch[6] = 0;
        application_base = (uint32_t*)(XIP_BASE + MAINAPP_OFFSET);
    }

    scb_hw->vtor = (uint32_t)application_base;
    __asm__(
        "msr msp, %0\n\t"
        "bx %1" : : "r" (application_base[0]),
                    "r" (application_base[1]) : "memory");
}

// Replace the reset handler when building the bootloader
// The rp2040_btldr.ld places real vector table at an offset.
__attribute__((section(".btldr_vectors")))
const void * btldr_vectors[2] = {&__StackTop, (void*)&btldr_reset_handler};

#endif


/********************************/
/* 2nd core code                */
/********************************/
void zuluide_setup(void)
{
}

mutex_t* platform_get_log_mutex() {
  return &logMutex;
}

void processStatusUpdate(const zuluide::status::SystemStatus &currentStatus) {
    // Notify the hardware UI of updates.
    display.HandleUpdate(currentStatus);

    // Notify the I2C server of updates.
     g_I2cServer.HandleUpdate(currentStatus);
}

/********************************/
/* Logic sniffer functionality  */
/********************************/

bool platform_enable_sniffer(const char *filename, bool passive)
{
    if (passive)
    {
        // Stop IDE phy and configure pins for passive input
        g_idecomm.enable_idephy = false;

        // Configure IDE bus for input mode
        // Data buffer is enabled in input mode.
        // Control buffer is disabled.
        for (int i = 0; i < 16; i++)
        {
            gpio_conf(IDE_D0 + i, GPIO_FUNC_SIO, false, false, false, false, true);
        }

        //        pin             function       pup   pdown  out    state fast
        gpio_conf(IDE_RST,        GPIO_FUNC_SIO, false, false, false, false, true); // Input
        gpio_conf(IDE_DIOW,       GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DIOR,       GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA0,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA1,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA2,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_CS0,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_CS1,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DMACK,      GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(CTRL_LOAD,      GPIO_FUNC_SIO, false, false, true, false, true); // Don't load ctrl mux
        gpio_conf(CTRL_nEN,       GPIO_FUNC_SIO, false, false, true, true, true);  // Disable ctrl mux
        gpio_conf(CTRL_IN_SEL,    GPIO_FUNC_SIO, false, false, true, true, true);  // Disable ctrl in mux
        gpio_conf(IDE_IORDY_EN,   GPIO_FUNC_SIO, false, false, true, true, true);  // Disable IORDY out
        gpio_conf(IDE_IOCS16,     GPIO_FUNC_SIO, false, false, true, true, true);  // Disable IOCS16 out
        gpio_conf(IDE_DATADIR,    GPIO_FUNC_SIO, false, false, true, false, true); // Data input
        gpio_conf(IDE_DATASEL,    GPIO_FUNC_SIO, false, false, true, false, true); // Enable data buffer
    }

    g_sniffer_enabled = true;
    return rp2350_sniffer_init(filename, passive);
}

void platform_sniffer_poll()
{
    rp2350_sniffer_poll();
}

/*************************************************/
/* SDK overrides for running in non-secure mode  */
/*************************************************/

#ifdef ARM_NONSECURE_MODE
// When the main firmware runs under ARM TrustZone, we must
// override some SDK functions. These have already been
// initialized by the bootloader.

extern "C" void runtime_init_bootrom_reset()
{
}

extern "C" void runtime_init_early_resets()
{
}

extern "C" void runtime_init_post_clock_resets()
{
    // JTAG and TBMAN peripherals are secure access only,
    // so we have to mask them out of reset.
    unreset_block_mask_wait_blocking(0x1fbffeff);
}

extern "C" void runtime_init_boot_locks_reset()
{
}

extern "C" void runtime_init_bootrom_locking_enable()
{
}

extern "C" void runtime_init_per_core_bootrom_reset()
{
}

#endif

// These functions are not used for SDIO mode but are needed to avoid build error.
void sdCsInit(SdCsPin_t pin) {}
void sdCsWrite(SdCsPin_t pin, bool level) {}

// SDIO configuration for main program
SdioConfig g_sd_sdio_config(DMA_SDIO);

void platform_set_sd_callback(sd_callback_t func, const uint8_t *buffer)
{
    rp2350_sdio_sdfat_set_callback(func, buffer);
}
